"""
    练习:通过代码获取两段内容,并且计算他们长度的和


    a = float(len(input("请输入:")))
    b = float(len(input("请输入:")))
    print("两段内容的长度和为:",a+b)
"""


"""
练习:
    获取用户的个人信息,并且存储到字典中
    个人信息包括,name,age,sex


    name = input("请输入您的姓名:")
    age = input("请输入您的年龄:")
    sex = input("请输入您的性别:")

    userinfo = {}

    userinfo["name"] = name
    userinfo["age"] = age
    userinfo["sex"] = sex
    print(userinfo)

"""

"""
练习:
现在有10个学生的成绩,需要录入系统
分别为张三,李四,王五,浪晋,流云,希希,亚索
名字和成绩需要对应上
而且大于60和小于60的需要分开存放.

"""


"""
练习:
打印99乘法表

"""

"""
练习:
通过print打印,模拟一个红绿灯的功能,注意:红灯30次,绿灯35次,黄灯3次
"""


"""
练习:
使用代码,实现一个注册的功能
用户输入账号和密码.要求账号长度是5-8位,密码6-12位,并且账号开头必须小写
储存到字典中,{username:password}
"""


"""
练习:
"""


"""
练习:
"""

"""
练习:
"""


"""
练习:
"""